Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ir.c
  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_IRR);

  tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);

  /* Set rx mode */
  switch (irRxCfg->rxMode) {
  case IR_RX_NEC:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x0);
    break;

  case IR_RX_RC5:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x1);
    break;

  case IR_RX_SWM:
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x2);
    break;

  default:
    break;
  }

  /* Enable or disable input inverse */
  ENABLE == irRxCfg->inputInverse ? (tmpVal = BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_IN_INV)) : (tmpVal = BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_IN_INV));
  /* Enable or disable rx input de-glitch function */
  ENABLE == irRxCfg->rxDeglitch ? (tmpVal = BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_DEG_EN)) : (tmpVal = BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_DEG_EN));
  /* Set de-glitch function cycle count */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_DEG_CNT, irRxCfg->DeglitchCnt);
  /* Write back */
  BL_WR_REG(IR_BASE, IRRX_CONFIG, tmpVal);

  tmpVal = BL_RD_REG(IR_BASE, IRRX_PW_CONFIG);
  /* Set pulse width threshold to trigger end condition */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_END_TH, irRxCfg->endThreshold - 1);
  /* Set pulse width threshold for logic0/1 detection */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_DATA_TH, irRxCfg->dataThreshold - 1);
  /* Write back */
  BL_WR_REG(IR_BASE, IRRX_PW_CONFIG, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(IRRX_IRQn, IRRX_IRQHandler);
#endif

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR set default value of all registers function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_DeInit(void) {
  GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_IRR);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR enable function
                                                                                *
                                                                                * @param  direct: IR direction type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_Enable(IR_Direction_Type direct) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_IR_DIRECTION_TYPE(direct));

  if (direct == IR_TX || direct == IR_TXRX) {
    /* Enable ir tx unit */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);
    BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRTX_EN));
  }

  if (direct == IR_RX || direct == IR_TXRX) {
    /* Enable ir rx unit */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_EN));
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR disable function
                                                                                *
                                                                                * @param  direct: IR direction type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_Disable(IR_Direction_Type direct) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_IR_DIRECTION_TYPE(direct));

  if (direct == IR_TX || direct == IR_TXRX) {
    /* Disable ir tx unit */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);
    BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRTX_EN));
  }

  if (direct == IR_RX || direct == IR_TXRX) {
    /* Disable ir rx unit */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_EN));
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR tx software mode enable or disable function
                                                                                *
                                                                                * @param  txSWM: Enable or disable
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_TxSWM(BL_Fun_Type txSWM) {
  uint32_t tmpVal;

  /* Enable or disable tx swm */
  tmpVal = BL_RD_REG(IR_BASE, IRTX_CONFIG);

  if (ENABLE == txSWM) {
    BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRTX_SWM_EN));
  } else {
    BL_WR_REG(IR_BASE, IRTX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRTX_SWM_EN));
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR clear rx fifo function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_RxFIFOClear(void) {
  uint32_t tmpVal;

  /* Clear rx fifo */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_SWM_FIFO_CONFIG_0);
  BL_WR_REG(IR_BASE, IRRX_SWM_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, IR_RX_FIFO_CLR));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR send data function
                                                                                *
                                                                                * @param  irWord: IR tx data word 0 or 1
                                                                                * @param  data: data to send
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_SendData(IR_Word_Type irWord, uint32_t data) {
  /* Check the parameters */
  CHECK_PARAM(IS_IR_WORD_TYPE(irWord));

  /* Write word 0 or word 1 */
  if (IR_WORD_0 == irWord) {
    BL_WR_REG(IR_BASE, IRTX_DATA_WORD0, data);
  } else {
    BL_WR_REG(IR_BASE, IRTX_DATA_WORD1, data);
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR software mode send pulse width data function
                                                                                *
                                                                                * @param  data: data to send
                                                                                * @param  length: Length of send buffer
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_SWMSendData(uint16_t *data, uint8_t length) {
  uint8_t  i = 0, j = 0;
  uint16_t minData = data[0];
  uint32_t tmpVal;
  uint32_t pwVal = 0;
  uint32_t count = (length + 7) / 8;

  /* Search for min value */
  for (i = 1; i < length; i++) {
    if (minData > data[i] && data[i] != 0) {
      minData = data[i];
    }
  }

  /* Set pulse width unit */
  tmpVal = BL_RD_REG(IR_BASE, IRTX_PULSE_WIDTH);
  BL_WR_REG(IR_BASE, IRTX_PULSE_WIDTH, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRTX_PW_UNIT, minData));

