Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ir.c
  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  IR software mode receive pulse width data function
                                                                                *
                                                                                * @param  data: Data received
                                                                                * @param  length: Max length of receive buffer
                                                                                *
                                                                                * @return Length of datas received
                                                                                *
                                                                                *******************************************************************************/
uint8_t IR_SWMReceiveData(uint16_t *data, uint8_t length) {
  uint8_t rxLen = 0;

  while (rxLen < length && IR_GetRxFIFOCount() > 0) {
    /* Read data */
    data[rxLen++] = BL_RD_REG(IR_BASE, IRRX_SWM_FIFO_RDATA) & 0xffff;
  }

  return rxLen;
}

/****************************************************************************/ /**
                                                                                * @brief  IR receive in NEC protocol
                                                                                *
                                                                                * @param  address: Address
                                                                                * @param  command: Command
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_ReceiveNEC(uint8_t *address, uint8_t *command) {
  uint32_t tmpVal = IR_ReceiveData(IR_WORD_0);

  *address = tmpVal & 0xff;
  *command = (tmpVal >> 16) & 0xff;

  if ((~(*address) & 0xff) != ((tmpVal >> 8) & 0xff) || (~(*command) & 0xff) != ((tmpVal >> 24) & 0xff)) {
    return ERROR;
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  IR get rx data bit count function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return IR rx data bit count
                                                                                *
                                                                                *******************************************************************************/
uint8_t IR_GetRxDataBitCount(void) {
  uint32_t tmpVal;

  /* Read rx data bit count */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_DATA_COUNT);
  tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_STS_IRRX_DATA_CNT);

  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  IR get rx fifo count function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return IR rx fifo available count
                                                                                *
                                                                                *******************************************************************************/
uint8_t IR_GetRxFIFOCount(void) {
  uint32_t tmpVal;

  /* Read rx fifo count */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_SWM_FIFO_CONFIG_0);
  tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_RX_FIFO_CNT);

  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  IR learning to set rx and tx mode function
                                                                                *
                                                                                * @param  data: Buffer to save data
                                                                                * @param  length: Length of data
                                                                                *
                                                                                * @return Protocol type
                                                                                *
                                                                                *******************************************************************************/
IR_RxMode_Type IR_LearnToInit(uint32_t *data, uint8_t *length) {
  uint32_t tmpVal;
  uint32_t timeoutCnt = IR_RX_INT_TIMEOUT_COUNT;

  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_IRR);

  /* Disable rx,set rx in software mode and enable rx input inverse */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_EN);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x2);
  tmpVal = BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_IN_INV);
  BL_WR_REG(IR_BASE, IRRX_CONFIG, tmpVal);
  /* Set pulse width threshold to trigger end condition */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_PW_CONFIG);
  BL_WR_REG(IR_BASE, IRRX_PW_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_END_TH, 19999));

