Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ir.c
  /* Clear and mask rx interrupt */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
  tmpVal = BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_MASK);
  BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_CLR));

  /* Enable rx */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
  BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_EN));

  /* Wait for rx interrupt */
  while (SET != IR_GetIntStatus(IR_INT_RX)) {
    timeoutCnt--;

    if (timeoutCnt == 0) {
      IR_Disable(IR_RX);

      return IR_RX_SWM;
    }
  }

  /* Disable rx */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
  BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_EN));

  /* Clear rx interrupt */
  tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
  BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_CLR));

  /*Receive data */
  *length = IR_GetRxFIFOCount();
  *length = IR_SWMReceiveData((uint16_t *)data, *length);

  /* Judge protocol type */
  if (NEC_HEAD_H_MIN < (data[0] & 0xffff) && (data[0] & 0xffff) < NEC_HEAD_H_MAX && NEC_HEAD_L_MIN < (data[0] >> 16) && (data[0] >> 16) < NEC_HEAD_L_MAX && NEC_BIT0_H_MIN < (data[1] & 0xffff)
      && (data[1] & 0xffff) < NEC_BIT0_H_MAX) {
    /* Set rx in NEC mode */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x0));
    /* Set pulse width threshold to trigger end condition and pulse width threshold for logic0/1 detection */
    BL_WR_REG(IR_BASE, IRRX_PW_CONFIG, 0x23270d47);
    /* Set tx in NEC mode */
    /* Tx configure */
    BL_WR_REG(IR_BASE, IRTX_CONFIG, 0x1f514);
    /* Set logic 0,logic 1,head and tail pulse width */
    BL_WR_REG(IR_BASE, IRTX_PW, 0x7f2000);
    /* Set modulation phase width and pulse width unit */
    BL_WR_REG(IR_BASE, IRTX_PULSE_WIDTH, 0x22110464);

    return IR_RX_NEC;
  } else if (RC5_ONE_PLUSE_MIN < (data[0] & 0xffff) && (data[0] & 0xffff) < RC5_ONE_PLUSE_MAX
             && ((RC5_ONE_PLUSE_MIN < (data[0] >> 16) && (data[0] >> 16) < RC5_ONE_PLUSE_MAX) || (RC5_TWO_PLUSE_MIN < (data[0] >> 16) && (data[0] >> 16) < RC5_TWO_PLUSE_MAX))
             && ((RC5_ONE_PLUSE_MIN < (data[1] & 0xffff) && (data[1] & 0xffff) < RC5_ONE_PLUSE_MAX) || (RC5_TWO_PLUSE_MIN < (data[1] & 0xffff) && (data[1] & 0xffff) < RC5_TWO_PLUSE_MAX))) {
    /* Set rx in RC-5 mode */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x1));
    /* Set pulse width threshold to trigger end condition and pulse width threshold for logic0/1 detection */
    BL_WR_REG(IR_BASE, IRRX_PW_CONFIG, 0x13870a6a);
    /* Set tx in RC-5 mode */
    /* Tx configure */
    BL_WR_REG(IR_BASE, IRTX_CONFIG, 0xc134);
    /* Set logic 0,logic 1,head and tail pulse width */
    BL_WR_REG(IR_BASE, IRTX_PW, 0);
    /* Set modulation phase width and pulse width unit */
    BL_WR_REG(IR_BASE, IRTX_PULSE_WIDTH, 0x221106f1);

    return IR_RX_RC5;
  } else if ((data[0] >> 16) != 0) {
    /* Set tx in software mode */
    /* Tx configure */
    BL_WR_REG(IR_BASE, IRTX_CONFIG, *length << 12 | 0xc);
    /* Set modulation phase width */
    BL_WR_REG(IR_BASE, IRTX_PULSE_WIDTH, 0x22110000);

    return IR_RX_SWM;
  } else {
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE);

    if (tmpVal == 0) {
      return IR_RX_NEC;
    } else if (tmpVal == 1) {
      return IR_RX_RC5;
    } else {
      return IR_RX_SWM;
    }
  }
}

/****************************************************************************/ /**
                                                                                * @brief  IR receive data according to mode which is learned function
                                                                                *
                                                                                * @param  mode: Protocol type
                                                                                * @param  data: Buffer to save data
                                                                                *
                                                                                * @return Length of data
                                                                                *
                                                                                *******************************************************************************/
uint8_t IR_LearnToReceive(IR_RxMode_Type mode, uint32_t *data) {
  uint8_t  length     = 0;
  uint32_t timeoutCnt = IR_RX_INT_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_IR_RXMODE_TYPE(mode));

  /* Disable ir rx */
  IR_Disable(IR_RX);

  /* Clear and mask rx interrupt */
  IR_ClrIntStatus(IR_INT_RX);
  IR_IntMask(IR_INT_RX, MASK);

  /* Enable ir rx */
  IR_Enable(IR_RX);

  /* Wait for rx interrupt */
  while (SET != IR_GetIntStatus(IR_INT_RX)) {
    timeoutCnt--;

    if (timeoutCnt == 0) {
      IR_Disable(IR_RX);

      return TIMEOUT;
    }
  }

  /* Disable ir rx */
  IR_Disable(IR_RX);

  /* Clear rx interrupt */
  IR_ClrIntStatus(IR_INT_RX);

  /* Receive data according to mode */
  if (mode == IR_RX_NEC || mode == IR_RX_RC5) {
    /* Get data bit count */
    length  = IR_GetRxDataBitCount();
    data[0] = IR_ReceiveData(IR_WORD_0);
  } else {
    /* Get fifo count */
    length = IR_GetRxFIFOCount();
    length = IR_SWMReceiveData((uint16_t *)data, length);
  }

  return length;
}

/****************************************************************************/ /**
                                                                                * @brief  IR send data according to mode which is learned function
                                                                                *
                                                                                * @param  mode: Protocol type
                                                                                * @param  data: Buffer of data to send
                                                                                * @param  length: Length of data
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type IR_LearnToSend(IR_RxMode_Type mode, uint32_t *data, uint8_t length) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_IR_RXMODE_TYPE(mode));

